Tekla Open API Reference for Tekla Structures 2025
Edge.EndPoint Property
 Gets the end point of the edge.
 Namespace: Tekla.Structures.Solid
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point EndPoint { get; }
Public ReadOnly Property EndPoint As Point
	Get
Property Value
Type: Point
See Also
Reference
Edge Class
Tekla.Structures.Solid Namespace